import '../models/traffic_light_info.dart';

final TrafficLightInfo trafficLightInfo = TrafficLightInfo(
  id: 'traffic-light',
  title: 'Тридцять сигналів світлофора',
  content: '''
Сигнали світлофора – червоний, зелений, жовтий, біло місячний. Чому саме ці кольори? Чому не блакитний, пурпуровий та коричневий, наприклад? Червоний колір символізує небезпеку у багатьох культурах, що з наукової точки зору пояснюється так: його світлова хвиля є найдовшою серед усіх видимих кольорів спектру. Це означає, що ви зможете побачити такий сигнал із максимально великої відстані. Таким чином, червоний колір означає стоп, зупинка.

Довжина світлової хвилі у зеленого коротше і слідує відразу за жовтим у видимому спектрі. Це означає, що його можна побачити з більшої відстані, ніж будь-який інший колір, крім червоного чи жовтого. Жовтий означає "Увага", тому що він майже так само добре помітний, як червоний.

Хочемо нагадати, що в алгоритмі проїзду перехрестя є пункт, коли треба визначити черговість проїзду перехрестя. І для визначення черговості, ми спочатку шукаємо регулювальника на перехресті, якщо регулювальника немає, тоді користуємося сигналами світлофора. Доречі, пішоходи, які почали рух на пішохідний світлофор (зелений сигнал), мають право закінчити перехід, навіть якщо сигнал змінився на забороняючий, якщо вони перебувають на дорожній розмітці «зебра» або на острівці безпеки.

Секунди для червоного та зеленого сигналу вказані для прикладу, тривалість залежить від конкретного перехрестя.

Давайте подивимося на приклад нижче і побачимо фази світлофора:

1) для зеленого та червоного авто горить зелений сигнал, в той час для автомобілів праворуч та ліворуч буде горіти червоний сигнал.

2) потім, зі сторони зеленого та червоного авто загориться червоний сигнал, ліворуч та праворуч відкриється шлях для автомобілів (загориться зелений сигнал).
''',
  imageUrls: [
    'assets/images/traffic_lights/phases.png',
    'assets/images/traffic_lights/intersection.png',
  ],
);